tutorials/Matyas_old/channelCaseConstructor2D/10_baseCasePimple/system/fvSchemesSIMPLE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    default                             steadyState;
    // default                             Euler;
}

gradSchemes
{
    default                             Gauss linear;
    grad(U)                             cellLimited Gauss linear 0.5;
}

divSchemes
{
    // default                             Gauss upwind phi;
    default                             Gauss upwind phi;
    div(phi,U)                          bounded Gauss linearUpwind grad(U);
    // div(phi,UD)                          Gauss linearUpwind grad(UD);
 //   div(phi,U)                          bounded Gauss linearUpwind grad(U);
 //   div(phi,K)                          bounded Gauss linearUpwind grad(U);
 //   div(phi,k)                          bounded Gauss linearUpwind grad(U);
 //   div(phi,omega)                      bounded Gauss linearUpwind grad(U);
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
//    div(phiRho,(0.5*magSqr(U)))         Gauss linear;
}

laplacianSchemes
{
    // default                             Gauss linear limited corrected 0.2;
    //  default                             Gauss linear uncorrected;       //orthogonal mesh
    //    // default                             Gauss upwind banana;       //orthogonal mesh
    default                               		Gauss upwind MGradT uncorrected;;       //orthogonal mesh
    laplacian((rho*nuEff),U)		Gauss linear uncorrected;
    laplacian((nuEff*rho),UD)    Gauss linear uncorrected;
    // laplacian((DEff*CO),(thermo:rho|molM))		Gauss upwind phi uncorrected;
    // laplacian((DEff*CO2),(thermo:rho|molM))		Gauss upwind phi uncorrected;
    // laplacian((DEff*O2),(thermo:rho|molM))		Gauss upwind phi uncorrected;
    // laplacian((DEff*(thermo:rho|molM)),CO)		Gauss upwind phi uncorrected;
    // laplacian((DEff*(thermo:rho|molM)),CO2)		Gauss upwind phi uncorrected;
    // laplacian((DEff*(thermo:rho|molM)),O2)		Gauss upwind phi uncorrected;
    laplacian((DEff*CO),(thermo:rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*CO2),(thermo:rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*O2),(thermo:rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*N2),(thermo:rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*H2),(thermo:rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(thermo:rho|Mg)),CO)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(thermo:rho|Mg)),CO2)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(thermo:rho|Mg)),O2)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(thermo:rho|Mg)),N2)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(thermo:rho|Mg)),H2)		Gauss upwind MGradT uncorrected;


    laplacian((DEff*CO),(rho|molM))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*CO2),(rho|molM))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*O2),(rho|molM))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*N2),(rho|molM))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*H2),(rho|molM))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|molM)),CO)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|molM)),CO2)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|molM)),O2)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|molM)),N2)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|molM)),H2)		Gauss upwind MGradT uncorrected;

    laplacian((DEff*CO),(rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*CO2),(rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*O2),(rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*N2),(rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*H2),(rho|Mg))		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|Mg)),CO)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|Mg)),CO2)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|Mg)),O2)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|Mg)),N2)		Gauss upwind MGradT uncorrected;
    laplacian((DEff*(rho|Mg)),H2)		Gauss upwind MGradT uncorrected;
    // laplacian(kappaEff,T)		Gauss upwind phi uncorrected;
    // laplacian(kappaEff,T)		Gauss upwind MGradT uncorrected;
    laplacian(kappa*epsEff,T)		Gauss downwind MGradT uncorrected;
    // laplacian(((kappaEff*(1-epsEff))+((((kappaA+(kappaB*T))+(kappaC*pow(T,2)))+(kappaD*pow(T,3)))*epsEff)),T) Gauss downwind MGradT uncorrected;
    laplacian((kappaEff+((((kappaA+(kappaB*T))+(kappaC*pow(T,2)))+(kappaD*pow(T,3)))*epsEff)),T) Gauss downwind MGradT uncorrected;
    // laplacian(kappaPokus,T)		Gauss upwind MGradT uncorrected;
    laplacian((rho*rAU),p)		Gauss linear uncorrected;
    //default                             Gauss upwind banana;       //orthogonal mesh
}

interpolationSchemes
{
    default                             linear;
    flux((rho*HbyA))                    linear;
    flux(HbyA)                          linear;
    interpolate(rho)                    linear;
}

snGradSchemes
{
    // default                             limited corrected 0.2;
    default                             uncorrected;                            // orthogonal mesh
}

fluxRequired
{
    default         no;
    p;
}

wallDist
{
    method          meshWave;
    correctWalls    true;
}

// ************************************************************************* //
